import {BotDictionary} from "./dicts";

export const uaDict: BotDictionary = {
    locale: "uk-UA",
    greet: "Привіт!",
    yes: "Так",
    no: "Ні",
    are_you_sure_to_logout: "Чи впевнені, що хочете вийти? Бот забуде ваш логін та пароль з сайту асталависта.",
    look_future_open_leagues: "Подивитись майбутні відкриті ліги",
    look_all_open_leagues: "Подивитись всі відкриті ліги",
    high_here_are_the_leagues: "Привіт, ось ліги. ✅ означає, що вас зареєєстровано, ➖ - не зареєстровано. Для реєстрации/зняття з ліги нажміть на відповідну дату.",
    main_menu: "Головне меню",
    help: "Допомога",
    logout: "Вийти (Разлогінитись)",
    login: "Увійти (Логін)",
    enter_hasta_website_login: "Введіть логін з сайту Асталавіста",
    enter_hasta_website_pwd: "Введіть пароль з сайту Асталавіста",
    thank_you_for_login: "Дякую за логін. Зберіг Ваші дані",
    enter_preffered_language_pls: "Введіть бажану мову будь ласка",
    thank_you: "Дякую",
    unknown_command: "Невідома команда",
    internal_error: "В боті виникла помилка. Зв'яжіться з адміном",
    need_login_to_register_for_the_leagues: "Вам треба залогінитись, щоб реєструватись на ліги",
    successfully_registered: "Зареєстрував на лігу",
    successfully_unregistered: "Зняв з участі в лізі",
    enter_yes_or_no: "Введіть так чи ні",
    successfully_logged_out: "Ви успішно вийшли",
    choose_language: "🇬🇧🇺🇦🇯🇵Змінити мову"
}
